In [ ]:
import numpy as np
import pandas as pd

train = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/provide_gas/train.csv', encoding='euc-kr')
test = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/provide_gas/test.csv')

In [ ]:
train.head()

          연월일  시간 구분       공급량
0  2013-01-01   1  A  2497.129
1  2013-01-01   2  A  2363.265
2  2013-01-01   3  A  2258.505
3  2013-01-01   4  A  2243.969
4  2013-01-01   5  A  2344.105

In [ ]:
test.head()

          일자|시간|구분
0  2019-01-01 01 A
1  2019-01-01 02 A
2  2019-01-01 03 A
3  2019-01-01 04 A
4  2019-01-01 05 A

In [ ]:
all_data = pd.concat([train, test], sort=False)
all_data.head()

          연월일   시간 구분       공급량 일자|시간|구분
0  2013-01-01  1.0  A  2497.129      NaN
1  2013-01-01  2.0  A  2363.265      NaN
2  2013-01-01  3.0  A  2258.505      NaN
3  2013-01-01  4.0  A  2243.969      NaN
4  2013-01-01  5.0  A  2344.105      NaN

In [ ]:
train['year'] = pd.to_numeric(train['연월일'].str[:4])
train['month'] = pd.to_numeric(train['연월일'].str[5:7])
train['day'] = pd.to_numeric(train['연월일'].str[8:10])
train['hour'] = train['시간']
train['type'] = train['구분']
train['gas'] = train['공급량']



train.head()

          연월일  시간 구분       공급량  year  month  day  hour type       gas
0  2013-01-01   1  A  2497.129  2013      1    1     1    A  2497.129
1  2013-01-01   2  A  2363.265  2013      1    1     2    A  2363.265
2  2013-01-01   3  A  2258.505  2013      1    1     3    A  2258.505
3  2013-01-01   4  A  2243.969  2013      1    1     4    A  2243.969
4  2013-01-01   5  A  2344.105  2013      1    1     5    A  2344.105

In [ ]:
types = train['구분'].unique()
count = 1

for i in types:
  train.loc[train['구분'] == i, 'type'] = count
  count += 1
train.head()

          연월일  시간 구분       공급량  year  month  day  hour type       gas
0  2013-01-01   1  A  2497.129  2013      1    1     1    1  2497.129
1  2013-01-01   2  A  2363.265  2013      1    1     2    1  2363.265
2  2013-01-01   3  A  2258.505  2013      1    1     3    1  2258.505
3  2013-01-01   4  A  2243.969  2013      1    1     4    1  2243.969
4  2013-01-01   5  A  2344.105  2013      1    1     5    1  2344.105

In [ ]:
test['year'] = pd.to_numeric(test['일자|시간|구분'].str[:4])
test['month'] = pd.to_numeric(test['일자|시간|구분'].str[5:7])
test['day'] = pd.to_numeric(test['일자|시간|구분'].str[8:10])
test['hour'] = pd.to_numeric(test['일자|시간|구분'].str[11:13])
test['구분'] = test['일자|시간|구분'].str[14:15]


test.head()

          일자|시간|구분  year  month  day  hour type 구분
0  2019-01-01 01 A  2019      1    1     1    A  A
1  2019-01-01 02 A  2019      1    1     2    A  A
2  2019-01-01 03 A  2019      1    1     3    A  A
3  2019-01-01 04 A  2019      1    1     4    A  A
4  2019-01-01 05 A  2019      1    1     5    A  A

In [ ]:
types = test['구분'].unique()
count = 1

for i in types:
  test.loc[test['구분'] == i, 'type'] = count
  count += 1
test.head()

          일자|시간|구분  year  month  day  hour type 구분
0  2019-01-01 01 A  2019      1    1     1    1  A
1  2019-01-01 02 A  2019      1    1     2    1  A
2  2019-01-01 03 A  2019      1    1     3    1  A
3  2019-01-01 04 A  2019      1    1     4    1  A
4  2019-01-01 05 A  2019      1    1     5    1  A

In [ ]:
train.columns

Index(['연월일', '시간', '구분', '공급량', 'year', 'month', 'day', 'hour', 'type',
       'gas'],
      dtype='object')

In [ ]:
x_col = ['year', 'month', 'day', 'hour', 'type']
y_col = ['gas']

x_train = train[x_col]
y_train = train['gas']

x_test = test[x_col]

In [ ]:
x_train.count()

year     368088
month    368088
day      368088
hour     368088
type     368088
dtype: int64

In [ ]:
from xgboost import XGBRegressor
from sklearn.ensemble import GradientBoostingRegressor, RandomForestRegressor
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error


xgb = XGBRegressor(random_state=42)
gbr = GradientBoostingRegressor(random_state=42)
rfr = RandomForestRegressor(random_state=42)
lr = LinearRegression()


#model_names = ['XGBRegressor', 'GradientBoostingRegressor', 'RandomForestRegressor', 'LinearRegression']
#models = [xgb, gbr, rfr, lr]
model_names = ['GradientBoostingRegressor', 'RandomForestRegressor', 'LinearRegression']
models = [gbr, rfr, lr]


for ms, mn in zip(models, model_names):
  print(mn)
  ms.fit(x_train, y_train)
  pred = ms.predict(x_test)

  #print(mn+" : "+(str)(mean_squared_error(y_train, pred, squared=False))+"\r\n")

GradientBoostingRegressor
RandomForestRegressor
LinearRegression

In [ ]:
submission = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/provide_gas/sample_submission.csv")

In [ ]:
gbr.fit(x_train, y_train)
pred = gbr.predict(x_test)

submission['공급량'] = pred

submission.head()

          일자|시간|구분          공급량
0  2019-01-01 01 A  2044.939839
1  2019-01-01 02 A  1949.263729
2  2019-01-01 03 A  1918.394490
3  2019-01-01 04 A  1918.394490
4  2019-01-01 05 A  1985.517753

In [ ]:
submission.to_csv("/content/drive/MyDrive/Colab Notebooks/provide_gas/submission.csv", index=False)